backend/controllers/UserController.php

SELECT `user_id`, `user_status`, `user_phone`, `register_time` FROM `yfc_users`
SELECT `user_name` FROM `yfc_user_info` WHERE `user_id`='1'
---
    public function actionPerson()
    {
        //查询用户的一些基本信息
        $db = new Query();
        $user = $db->select('user_id,user_status,user_phone,register_time')->from('yfc_users')->all();

        //根据用户ID 查询用户的用户名 加用户名字段塞到$user中
        foreach ($user as $key => $value) {
            $user_id = $value['user_id'];
            $user_info = $db->select('user_name')->from('yfc_user_info')->where(['user_id'=>$user_id])->one();

UPDATE `yfc_users` SET `user_status`=1 WHERE `user_id` IS NULL
UPDATE `yfc_users` SET `user_status`=0 WHERE `user_id`='13'
SELECT * FROM `yfc_users` WHERE `user_id`='13'
---
    public function actionUser_status()
    {
        $request = Yii::$app->request;
        $user_id = $request->post('user_id');
        $is_show = $request->post('is_show');

        if($is_show == 0){
            //正常改为锁定
            $db = \Yii::$app->db->createCommand();
            $res = $db->update('yfc_users',['user_status'=>1],['user_id'=>$user_id])->execute();
            if($res){
                //修改状态之后  查看新的状态
                $db = new \yii\db\Query;
                $user_status = $db->select('*')->from('yfc_users')->where(['user_id'=>$user_id])->one();
            }
        }else{
            //锁定改为正常
            $db = \Yii::$app->db->createCommand();
            $res = $db->update('yfc_users',['user_status'=>0],['user_id'=>$user_id])->execute();
            if($res){
                //修改状态之后  查看新的状态
                $db = new \yii\db\Query;
                $user_status = $db->select('*')->from('yfc_users')->where(['user_id'=>$user_id])->one();