frontend/controllers/SearchController.php

SELECT COUNT(*) FROM `yfc_merchant` WHERE `mer_status`='0'
SELECT `info_mer_cate`, `info_catipa`, `mer_id`, `mer_name`, `mer_address` FROM `yfc_merchant` WHERE `mer_status`='0' LIMIT 2
---
    public function actionSearch()
    {
        $type = Yii::$app->request->get('search_type');
        if ($type == 'shop') {
            //搜索店铺
            $search = Yii::$app->request->get();

            $cate_id = isset($search['cate']) ? $search['cate'] : '';
            $dis_id  = isset($search['dis']) ? $search['dis'] : '';
            $catipa  = isset($search['catipa']) ? $search['catipa'] : '-';
            $catipa  = explode('-', $catipa);
            $min     = isset($catipa[0]) ? $catipa[0] : '';
            $max     = isset($catipa[1]) ? $catipa[1] : '';
            $order   = isset($search['order']) ? str_replace('-',' ',$search['order']) : '';
//            var_dump($catipa);

            $shop = Merchant::find()
                ->select(['info_mer_cate', 'info_catipa', 'mer_id', 'mer_name', 'mer_address'])
                ->where(['mer_status' => '0'])
                ->andFilterWhere(['like', 'mer_name', $search['keyword']])
                ->andFilterWhere(['=', 'info_mer_cate', $cate_id])
                ->andFilterWhere(['=', 'dis_id', $dis_id])
                ->andFilterWhere(['between', 'info_catipa', $min, $max]);

            $pages = new Pagination(['totalCount' => $shop->count(), 'pageSize' => '2']);

SELECT * FROM `yfc_mer_category`
SELECT * FROM `yfc_district`
---
            }
//            var_dump($shop);
            //分类
            $cate = MerCategory::find()->asArray()->all();
            //地区
            $dis = District::find()->asArray()->all();