frontend/controllers/UserController.php

SELECT `yfc_user_info`.* FROM `yfc_user_info` LEFT JOIN `yfc_users` ON `yfc_user_info`.`user_id` = `yfc_users`.`user_id` WHERE `yfc_user_info`.`user_id`=1
---
    public function actionUser_index()
    {
        //相当于获取用户id
        $user_id=Yii::$app->request->get('user_id');

        //实例化模型层并且查询用户信息（积分在用户信息表中）
        $info= new User_info;
        $user= $info->find()->joinWith('users')->where(['yfc_user_info.user_id'=>$user_id])->asArray()->one();

SELECT * FROM `yfc_tickets` WHERE `tic_id` IN ('1', '2')
SELECT * FROM `yfc_user_ticket` WHERE `yfc_user_ticket`.`user_id`=1
---
    public function actionUser_coupon()
    {
        //相当于获取用户id
        $user_id=Yii::$app->request->get('user_id');

        //查询优惠券信息，判断过期时间
        $ticket= new User_ticket;
        $user= $ticket->find()->with('tickets')->where(['yfc_user_ticket.user_id'=>$user_id])->asArray()->All();

DELETE FROM `yfc_tickets` WHERE cun_id='2'
DELETE FROM `yfc_user_ticket` WHERE cun_id='1'
---
    public function actionDel_tic()
    {
        $cun_id=Yii::$app->request->get('cun_id');
        $res=Yii::$app->db->createCommand()->delete("yfc_user_ticket","cun_id=:cun_id",[':cun_id'=>$cun_id])->execute();

SELECT * FROM `yfc_collect` WHERE `yfc_collect`.`user_id`=1
SELECT * FROM `yfc_merchant` WHERE `mer_id` IN ('1', '2')
---
    public function actionUser_collect()
    {
        $user_id=Yii::$app->request->get('user_id');

        /*查询用户关注的所有商家*/
        $collect=new Collect;
        $arr= $collect->find()->with('merchant')->where(['yfc_collect.user_id'=>$user_id])->asArray()->All();